In [1]:
import pandas as pd

# join() â€” index-based joining
    join() :
        - is a DataFrame method that aligns on the index by default.
        - It is convenient when your datasets use the index as the key.
        - Under the hood df1.join(df2) is similar to pd.merge(df1, df2, left_index=True,
         right_index=True)

In [5]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})

df_customers = customers.set_index('CustomerID')

balances = pd.DataFrame({
    'Balance': [150, 80, 200]
}, index=[2, 3, 5])   # index 5 not in df_customers

In [6]:
# Default join() (left join)
df_customers.join(balances)
# Explanation: by default join() does left join, keeping all rows of df_customers. Index 5 from balances is not included.

               Name         City  Balance
CustomerID
1             Alice     New York      NaN
2               Bob  Los Angeles    150.0
3           Charlie      Chicago     80.0
4             Diana      Houston      NaN

In [7]:
# Outer join with join
df_customers.join(balances, how='outer')

      Name         City  Balance
1    Alice     New York      NaN
2      Bob  Los Angeles    150.0
3  Charlie      Chicago     80.0
4    Diana      Houston      NaN
5      NaN          NaN    200.0